[
  {
    "id": "book-1771825445810-szn03ncw",
    "title": "এক নজরে কভার",
    "author": "মিজানুর রহমান আজহারি",
    "chapters": [
      {
        "id": "chapter-1771825472186-q4jjyr2y",
        "parts": [
          {
            "id": "part-1771825564228-n0pw0o4d",
            "title": "কুরআন মাজীদ লিখিত আকারে সংকলিত হওয়ার ক্ষেত্রে তিনটি ধাপ অতিক্রম করেছে",
            "content": "কুরআন মাজীদ লিখিত আকারে সংকলিত হওয়ার ক্ষেত্রে তিনটি ধাপ অতিক্রম করেছে— ১ম ধাপ: নবী সাল্লাহাহু আলাইহি ওয়া সালাম-এর যুগ, ২য় ধাপ: আবু বকর রাদিয়াল্লাহ-এর যুগ, ৩য় ধাপ: উসমান রাদিয়াল্লাহ-এর যুগ। আর এই শেষ ধাপে যখন সংকলন করা হয়, তখন কুরআনের অনেকগুলো প্রতিলিপি তৈরি করে বিভিন্ন অঞ্চলে পাঠানো হয়।",
            "progress": 100,
            "voiceName": "Charon",
            "isGenerating": false
          },
          {
            "id": "part-1771825638322-fc3m3lfl",
            "title": "১ম ধাপ: নবী সাল্লাহাহু আলাইহি ওয়া সালাম-এর যুগে - Part 1",
            "content": "নবী সাল্লাহাহু আলাইহি ওয়া সালাম-এর যুগে কুরআন সংকলনের প্রথম ও প্রধান উপায় ছিল—মুখস্থ করা ও হৃদয়ে ধারণ করা। কারণ, নবী সাল্লাহাহু আলাইহি ওয়া সালাম ছিলেন একজন ‘উম্মি’ অর্থাৎ যিনি লিখতে-পড়তে জানতেন না। আর তিনি এমন এক জাতির মধ্যে প্রেরিত হয়েছিলেন, যারা মূলত মুখস্থ বিদ্যার ওপরই নির্ভর করত। আবার সে সময় লেখার উপকরণও সহজলভ্য ছিল না। তাই মূলত সাহাবীরা কুরআন মুখস্থ করাকেই প্রাধান্য দিতেন। এটি ছিল তখনকার আরবদের সাধারণ রীতি। তারা তাদের কবিতা, বংশপরিচয়, গৌরবগাথা এবং ঐতিহাসিক ঘটনাগুলো মুখস্থ রাখত।\n\nনবী সাল্লাহাহু আলাইহি ওয়া সালাম-এর কাছে যখন ওহী আসত, তখনই তিনি তা মুখস্থ করে নিতেন। ফলে কুরআন সংরক্ষণের সবচেয়ে নিরাপদ জায়গা ছিল—নবী সাল্লাহাহু আলাইহি ওয়া সালাম-এর স্মৃতিশক্তি, যেখানে কোনো ভুল-ভ্রান্তি বা পরিবর্তনের আশঙ্কা ছিল না। তদুপরি, অতিরিক্ত সতর্কতা হিসেবে প্রতি বছর রমাদান মাসে তিনি জিবরাঈল আলাইহিস সালাম-এর কাছে সম্পূর্ণ কুরআন তিলাওয়াত করতেন। নবী সাল্লাহাহু আলাইহি ওয়া সালাম-এর ইন্তেকালের বছরে তিনি জিবরাঈল আলাইহিস সালাম-এর সঙ্গে পূর্ণ কুরআন দুবার খতম করেন।\n\nসাহাবায়ে কেরাম রাদিয়াল্লাহ-ও কুরআনের ব্যাপারে ছিলেন অত্যন্ত যত্নশীল। তারা কুরআন মুখস্থ করা ও সংরক্ষণ করার ক্ষেত্রে একে অপরের সঙ্গে প্রতিযোগিতা করতেন। কুরআন অধ্যয়ন ও বোঝার জন্য তারা ছিলেন অধীর আগ্রহী। কে কতটুকু কুরআন মুখস্থ করেছেন, তার ভিত্তিতে তাদের মাঝে মর্যাদার পার্থক্য হতো। এমনকি কোনো কোনো নারী সাহাবীর জন্য তার বিয়ের মোহর হতো একটি কুরআনের সূরা, যা তার স্বামী তাঁকে শেখাতেন।",
            "progress": 100,
            "voiceName": "Charon",
            "isGenerating": false
          },
          {
            "id": "part-1771825681219-2f7o4iug",
            "title": "১ম ধাপ: নবী সাল্লাহাহু আলাইহি ওয়া সালাম-এর যুগে - Part 2",
            "content": "তারা ঘুমের আরাম ও বিশ্রাম ত্যাগ করে রাত জেগে কুরআন তিলাওয়াত করতেন। গভীর রাতে কেউ সাহাবায়ে কেরামের ঘরের পাশ দিয়ে গেলে শুনতে পেতেন কুরআন তিলাওয়াতের শব্দ, যা মৌমাছির গুঞ্জনের মতো প্রতিধ্বনিত হতো। রাসূলুল্লাহ সাল্লাহাহু আলাইহি ওয়া সালাম তাঁদের মধ্যে কুরআনের প্রতি এই ভালোবাসা ও যত্ন আরও দৃঢ় করতেন। তিনি তাঁদের কাছে আল্লাহর পক্ষ থেকে অবতীর্ণ ওহী পৌঁছে দিতেন এবং দূরবর্তী সাহাবীদের কাছে কুরআন শিক্ষার জন্য প্রতিনিধি পাঠাতেন।\n\nযেমন: উবাদা ইবনু সাবিত রাদিয়াল্লাহ বলেন, ‘যখন কেউ হিজরত করে মদিনায় আসত, তখন নবী সাল্লাহাহু আলাইহি ওয়া সালাম তাকে আমাদের মধ্যে কোনো এক সাহাবীর কাছে দিয়ে দিতেন, যাতে সে তাকে কুরআন শেখায়।’ মসজিদে নববীতে কুরআন তিলাওয়াতের শব্দে একপ্রকার গুঞ্জন সৃষ্টি হতো, এমনকি নবী সাল্লাহাহু আলাইহি ওয়া সালাম তাঁদেরকে নির্দেশ দিয়েছিলেন—তোমরা আওয়াজ একটু নিচু করো, যেন একে অপরের সঙ্গে শব্দ মিশে বিভ্রান্তি সৃষ্টি না হয়।\n\nওহী লিখন: তবে নবী সাল্লাহাহু আলাইহি ওয়া সালাম-এর যুগে যে কুরআন কেবল মুখস্থই করা হয়েছিল, তা নয়; বরং লিখিতও হয়েছিল। নবী সাল্লাহাহু আলাইহি ওয়া সালাম ওহি লেখার জন্য বিশেষ লেখক নিয়োগ করেছিলেন। যখনই নতুন আয়াত নাজিল হতো, তিনি ওহি-লেখকদের (যথা: আবু বকর, ওমর, উসমান, আলী, মুয়াবিয়া, উবাই ইবনু কা’ব, যায়িদ ইবনু সাবিত রাদিয়াল্লাহ প্রমুখ) ডেকে বলতেন, যেন তা নির্দিষ্ট স্থানে লেখা হয়। সাহাবীগণ খেজুর গাছের পাতা, চামড়া, পাথরের টুকরো ও পশুর কাঁধের হাড়ে কুরআন লিখতেন। এগুলো রাসূল সাল্লাহাহু আলাইহি ওয়া সালাম-এর ঘরে সংরক্ষিত থাকত। তবে তখনো কুরআন একত্রিত করে এক খণ্ড পুস্তক বা মুসহাফ হিসেবে লিপিবদ্ধ করা হয়নি।",
            "progress": 100,
            "voiceName": "Zephyr",
            "isGenerating": false
          },
          {
            "id": "part-1771825955228-kb08knw3",
            "title": "২য় ধাপ: আবু বকর রাদিয়াল্লাহ-এর যুগ",
            "content": "রাসূল সাল্লাহাহু আলাইহি ওয়া সালাম-এর জীবদ্দশাতেই গোটা কুরআন লিখা হয়েছিল, তবে তা ছিল বিক্ষিপ্ত আকারে। আবু বকর সিদ্দীক রাদিয়াল্লাহ-এর খিলাফাতকালে ইয়ামামার যুদ্ধে বহু সংখ্যক হাফেজ সাহাবী শহীদ হন। এর প্রেক্ষিতে তিনি কুরআনকে এক-খণ্ডে সংরক্ষণ করার প্রয়োজনীয়তা বোধ করলেন। না হলে আশঙ্কা ছিল—এভাবে হাফেজ সাহাবীগণ শহীদ হতে থাকলে কুরআনের বড় একটি অংশ বিলুপ্ত হয়ে যাবে।\n\nঅতঃপর এ কাজের দায়িত্ব দেওয়া হলো যায়িদ ইবনু সাবিত রাদিয়াল্লাহ-কে। যায়িদ (নিজে হাফেজ হওয়া সত্ত্বেও) অধিক সতর্কতা বজায় রাখতে বিশেষ পদ্ধতি গ্রহণ করেন। তিনি প্রতিটি আয়াত গ্রহণের ক্ষেত্রে দুইজন নির্ভরযোগ্য সাহাবীর সাক্ষ্য নিতেন যে, এই আয়াতটি রাসূল সাল্লাহাহু আলাইহি ওয়া সালাম-এর সামনেই লেখা হয়েছিল। এভাবে তিনি সকল উৎস থেকে তথ্য সংগ্রহ করে কুরআন মাজীদ এক জায়গায় সংকলন করেন।",
            "progress": 30,
            "voiceName": "Charon",
            "isGenerating": true
          },
          {
            "id": "part-1771825977738-qcy9nvzr",
            "error": "Generation canceled. You can re-generate this part.",
            "title": "৩য় ধাপ: উসমান রাদিয়াল্লাহ-এর যুগ",
            "content": "ইসলামি সাম্রাজ্য যখন বহুদূর ছড়িয়ে পড়ল, তখন বিভিন্ন অঞ্চলের মানুষ ভিন্ন ভিন্ন পাঠরীতিতে (কিরাআত) কুরআন পড়তে শুরু করে। এর ফলে মানুষের মধ্যে দ্বন্দ্বের আশঙ্কা দেখা দেয়। এই দ্বন্দ্ব নিরসনে কার্যকরী পন্থা ছিল একটাই—একটি সংকলনে সমস্ত নির্ভরযোগ্য কিরাআত একত্র করা এবং তা সারা মুসলিম-বিশ্বে ছড়িয়ে দেওয়া।\n\nউসমান রাদিয়াল্লাহ চারজন সাহাবীর (যায়িদ ইবনু সাবিত, আবদুল্লাহ ইবনুয যুবায়র, সাঈদ ইবনুল আস ও আবদুর রহমান ইবনু হারিস রাদিয়াল্লাহ) একটি পরিষদ গঠন করেন। তাঁদের দায়িত্ব ছিল আবু বকর রাদিয়াল্লাহ-এর সংকলিত মুসহাফটির (যা হাফসা রাদিয়াল্লাহ-এর কাছে ছিল) বেশ কিছু অনুলিপি তৈরি করা। উসমান রাদিয়াল্লাহ-এর নির্দেশনা ছিল—যদি কোনো অংশে মতবিরোধ দেখা দেয়, তবে কুরাইশি-রীতি অগ্রাধিকার পাবে, কারণ কুরআন তাদের ভাষাতেই নাজিল হয়েছে।\n\nতাঁরা কুরআনের আয়াতগুলোকে এমনভাবে লিখলেন যেখানে কোনো নুকতা ও হরকত ব্যবহার করেননি, যাতে মুতাওয়াতির সবগুলো কিরাআতই এর অন্তর্ভুক্ত হতে পারে। পরিশেষে, এই সত্যায়িত কপিটির একাধিক অনুলিপি (৭টি মতান্তরে) তৈরি করে মদীনা, মক্কা, শাম, ইয়ামান, বাহরাইন, বসরা ও কুফায় পাঠিয়ে দেওয়া হয়। এর ফলে কুরআনের পাঠ-রীতিকে কেন্দ্র করে সকল দ্বন্দ্ব-সংঘাতের অবসান ঘটে।",
            "progress": 0,
            "voiceName": "Charon",
            "isGenerating": false
          }
        ],
        "title": "কুরআন সংকলনের ইতিহাস:"
      }
    ],
    "coverUrl": "https://wafilife-media.wafilife.com/uploads/2025/02/%E0%A6%8F%E0%A6%95-%E0%A6%A8%E0%A6%9C%E0%A6%B0%E0%A7%87-%E0%A6%95%E0%A6%AD%E0%A6%BE%E0%A6%B0.jpg",
    "createdAt": 1771825445810,
    "description": "এক-নজরে কুরআন একটি গবেষণাধর্মী বই, যা কুরআনকে জানার তৃষ্ণা বাড়াবে। কুরআনের সাথে আমাদের বন্ধন গড়ে তুলবে, আর কুরআন থেকে উপকৃত হবার পথও বাতলে দেবে। অল্প সময়ের জন্য এই বইটিতে চোখ বোলালেও, একেকটি সূরার মূলকথা, মেজর থিম ও ফজিলত জেনে নেওয়া সম্ভব।"
  }
]